       IDENTIFICATION DIVISION. 
       PROGRAM-ID. DEMO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           CLASS PassingScore IS "A" THRU "C","D"
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 Age p
       01 SAMPLEDATA PIC X(10) VALUE "STUFF".
       01 JUSTLETTERS PIC AAA VALUE "ABC".
       01 JUSTNUM PIC 9(4) VALUE 1234.
       01 SIGNEDINT PIC S9(4) VALUE -1234.
       01 PAYCHECK PIC 9(4)V99 VALUE ZEROS.
       01 CUSTOMER.
           02 IDENT PIC 9(3).
           02 CUSTNAME PIC X(20).
           02 DATEOFBIRTH.
               03 MOB PIC 99.
               03 DOB PIC 99.
               03 YOB PIC 9999.
       01 NUM1 PIC 9 VALUE 5.
       01 NUM2 PIC 9 VALUE 4.
       01 NUM3 PIC 9 VALUE 3.
       01 ANS PIC S99V99 VALUE 0.
       01 REM PIC 9V99. 
       PROCEDURE DIVISION.
       MOVE "MORE STUFF" TO SAMPLEDATA
       MOVE "123" TO SAMPLEDATA
       MOVE 123 TO SAMPLEDATA
       DISPLAY SAMPLEDATA
       DISPLAY PAYCHECK
       MOVE "123Bob Smith           12211992" TO CUSTOMER
       DISPLAY CUSTNAME
       DISPLAY MOB "/" DOB "/" YOB
       MOVE SPACE TO SAMPLEDATA.
       DISPLAY SAMPLEDATA.
       MOVE HIGH-VALUE TO SAMPLEDATA.
       DISPLAY SAMPLEDATA.
       MOVE ALL "2" TO SAMPLEDATA.
       DISPLAY SAMPLEDATA.



       ADD NUM1 TO NUM2 GIVING ANS
       DISPLAY ANS
       SUBTRACT NUM1 FROM NUM2 GIVING ANS
       DISPLAY ANS
       MULTIPLY NUM1 BY NUM2 GIVING ANS
       DISPLAY ANS
       DIVIDE NUM1 INTO NUM2 GIVING ANS
       DISPLAY ANS
       DIVIDE NUM1 INTO NUM2 GIVING ANS REMAINDER Rem
       display "remainder " Rem
       

       ADD NUM1,NUM2 TO NUM3 GIVING ANS
       ADD NUM1,NUM2,NUM3, GIVING ANS
       DISPLAY ANS
       COMPUTE ANS = NUM1 + NUM2
       DISPLAY ANS
       COMPUTE ANS = NUM1 - NUM2
       DISPLAY ANS
       COMPUTE ANS = NUM1 * NUM2
       DISPLAY ANS
       COMPUTE ANS = NUM1 / NUM2
       DISPLAY ANS

       COMPUTE ANS = NUM1 ** 2
       DISPLAY ANS
       COMPUTE ANS = (3 + 5) * 5
       DISPLAY ANS
       COMPUTE ANS = 3 + 5 * 5
       DISPLAY ANS
       COMPUTE ANS ROUNDED = 3.0 + 2.005
       DISPLAY ANS

       


       STOP RUN.
       END PROGRAM DEMO.